Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Things like message ID, context (``msgctxt``) or location in source code.
sv: Saker som meddelande-ID, sammanhang (``msgctxt``) eller plats i kÃ¤llkoden.

source: Screenshots can be uploaded to Weblate to better inform translators of where and how the string is used, see :ref:`screenshots`.
sv: SkÃ¤rmdumpar kan laddas upp till Weblate fÃ¶r att bÃ¤ttre informera Ã¶versÃ¤ttarna om var och hur strÃ¤ngen anvÃ¤nds, se :ref:`screenshots`.

source: Displays neighbouring strings from the translation file. These are usually also used in a similar context and prove useful in keeping the translation consistent.
sv: Visar nÃ¤rliggande strÃ¤ngar frÃ¥n Ã¶versÃ¤ttningsfilen. Dessa anvÃ¤nds vanligtvis ocksÃ¥ i ett liknande sammanhang och Ã¤r anvÃ¤ndbara fÃ¶r att hÃ¥lla Ã¶versÃ¤ttningen konsekvent.

source: In case a message appears in multiple places (e.g. multiple components), this tab shows all of them if they are found to be inconsistent (see :ref:`check-inconsistent`). You can choose which one to use.
sv: Om ett meddelande visas pÃ¥ flera stÃ¤llen (t.ex. flera komponenter) visar den hÃ¤r fliken alla om de visar sig vara inkonsekventa (se :ref:`check-inconsistent`). Du kan vÃ¤lja vilken du vill anvÃ¤nda.

source: Look at similar strings translated in past, see :ref:`memory`.
sv: Se liknande strÃ¤ngar som Ã¶versatts tidigare, se :ref:`memory`.

source: Displays terms from the project glossary used in the current message.
sv: Visar termer frÃ¥n projektordlistan som anvÃ¤nds i det aktuella meddelandet.

source: List of people whom have changed this message recently using Weblate.
sv: Lista Ã¶ver personer som nyligen har Ã¤ndrat detta meddelande med hjÃ¤lp av Weblate.

source: Project info like instructions for translators, or a directory or link to the string in the version control system repository the project uses.
sv: Projektinformation som instruktioner fÃ¶r Ã¶versÃ¤ttare, eller en katalog eller lÃ¤nk till strÃ¤ngen i det versionshanteringssystem som projektet anvÃ¤nder.

source: If you want direct links, the translation format has to support it.
sv: Om du vill ha direkta lÃ¤nkar mÃ¥ste Ã¶versÃ¤ttningsformatet stÃ¶dja detta.

source: Translation history
sv: ÃversÃ¤ttningshistorik

source: Every change is by default (unless turned-off in component settings) saved in the database, and can be reverted. Optionally, translations can also be reverted in the underlying version control system.
sv: Varje Ã¤ndring sparas som standard (om inte den Ã¤r inaktiverad i komponentinstÃ¤llningarna) i databasen och kan Ã¥terstÃ¤llas. ÃversÃ¤ttningar kan ocksÃ¥ Ã¥terstÃ¤llas i det underliggande versionshanteringssystemet.

source: Translated string length
sv: Ãversatt strÃ¤nglÃ¤ngd

source: Weblate can limit the length of a translation in several ways to ensure the translated string is not too long:
sv: Weblate kan begrÃ¤nsa lÃ¤ngden pÃ¥ en Ã¶versÃ¤ttning pÃ¥ flera sÃ¤tt fÃ¶r att sÃ¤kerstÃ¤lla att den Ã¶versatta strÃ¤ngen inte blir fÃ¶r lÃ¥ng:

source: The default limitation for translation is ten times longer than the source string. This can be modified with :setting:`LIMIT_TRANSLATION_LENGTH_BY_SOURCE_LENGTH`. If you are hitting this, it can also be caused by a monolingual translation being wrongly set up as a bilingual one, making Weblate mistaking the translation key for the actual source string. See :ref:`bimono` for more info.
sv: StandardbegrÃ¤nsningen fÃ¶r Ã¶versÃ¤ttning Ã¤r tio gÃ¥nger lÃ¤ngre Ã¤n kÃ¤llstrÃ¤ngen. Detta kan Ã¤ndras med :setting:`LIMIT_TRANSLATION_LENGTH_BY_SOURCE_LENGTH`. Om du stÃ¶ter pÃ¥ detta kan det ocksÃ¥ bero pÃ¥ att en ensprÃ¥kig Ã¶versÃ¤ttning felaktigt har konfigurerats som en tvÃ¥sprÃ¥kig, vilket gÃ¶r att Weblate misstar Ã¶versÃ¤ttningsnyckeln fÃ¶r den faktiska kÃ¤llstrÃ¤ngen. Se :ref:`bimono` fÃ¶r mer information.

source: Maximum length in characters defined by the translation file or flag, as per :ref:`check-max-length`.
sv: Maximal lÃ¤ngd i tecken definierad av Ã¶versÃ¤ttningsfilen eller flaggan, enligt :ref:`check-max-length`.

source: Maximal rendered size in pixels as defined by flags; see :ref:`check-max-size`.
sv: Maximal renderad storlek i pixlar enligt definitionen i flaggorna; se :ref:`check-max-size`.

source: Based on configuration and your translated language, Weblate provides suggestions from several machine translation tools and :ref:`translation-memory`. All machine translations are available in a single tab of each translation page.
sv: Baserat pÃ¥ konfigurationen och ditt Ã¶versatta sprÃ¥k ger Weblate fÃ¶rslag frÃ¥n flera maskinÃ¶versÃ¤ttningsverktyg och :ref:`translation-memory`. Alla maskinÃ¶versÃ¤ttningar finns tillgÃ¤ngliga i en enda flik pÃ¥ varje Ã¶versÃ¤ttningssida.

source: You can also perform a concordance search on the :ref:`translation-memory`.
sv: Du kan ocksÃ¥ gÃ¶ra en konkordanssÃ¶kning i :ref:`translation-memory`.

source: You can find the list of supported tools in :ref:`machine-translation-setup`.
sv: Du hittar listan Ã¶ver verktyg som stÃ¶ds i :ref:`machine-translation-setup`.

source: You can use automatic translation to bootstrap translation based on external sources. This tool is called :guilabel:`Automatic translation` accessible in the :guilabel:`Operations` menu, once you have selected a component and a language:
sv: Du kan anvÃ¤nda automatisk Ã¶versÃ¤ttning fÃ¶r att starta Ã¶versÃ¤ttningen baserat pÃ¥ externa kÃ¤llor. Detta verktyg kallas :guilabel:`Automatisk Ã¶versÃ¤ttning` och Ã¤r tillgÃ¤ngligt i menyn :guilabel:`Operationer` nÃ¤r du har valt en komponent och ett sprÃ¥k:

source: A similar operation :guilabel:`Batch automatic translation` is available if you have selected a project language, a component or a category.
sv: En liknande funktion :guilabel:`Automatisk massÃ¶versÃ¤ttning` Ã¤r tillgÃ¤nglig om du har valt ett projektsprÃ¥k, en komponent eller en kategori.

source: Two modes of operation are possible:
sv: TvÃ¥ driftslÃ¤gen Ã¤r mÃ¶jliga:

source: Using other Weblate components as a source for translations.
sv: AnvÃ¤nda andra Weblate-komponenter som kÃ¤lla fÃ¶r Ã¶versÃ¤ttningar.

source: Using selected machine translation services with translations above a certain quality threshold.
sv: AnvÃ¤nda utvalda maskinÃ¶versÃ¤ttningstjÃ¤nster med Ã¶versÃ¤ttningar som Ã¶verstiger en viss kvalitetstrÃ¶skel.

source: You can also choose which strings are to be auto-translated.
sv: Du kan ocksÃ¥ vÃ¤lja vilka strÃ¤ngar som ska Ã¶versÃ¤ttas automatiskt.

source: Be mindful that this will overwrite existing translations if employed with wide filters such as :guilabel:`All strings`.
sv: TÃ¤nk pÃ¥ att detta kommer att skriva Ã¶ver befintliga Ã¶versÃ¤ttningar om det anvÃ¤nds med breda filter som :guilabel:`Alla strÃ¤ngar`.

source: Useful in several situations like consolidating translation between different components (for example the application and its website) or when bootstrapping a translation for a new component using existing translations (translation memory).
sv: AnvÃ¤ndbart i flera situationer, till exempel fÃ¶r att konsolidera Ã¶versÃ¤ttningar mellan olika komponenter (till exempel applikationen och dess webbplats) eller nÃ¤r man startar en Ã¶versÃ¤ttning fÃ¶r en ny komponent med hjÃ¤lp av befintliga Ã¶versÃ¤ttningar (Ã¶versÃ¤ttningsminne).

source: The automatically translated strings are labelled :guilabel:`Automatically translated`.
sv: De automatiskt Ã¶versatta strÃ¤ngarna Ã¤r mÃ¤rkta med :guilabel:`Automatically translated`.

source: To avoid abuse of the interface, rate limiting is applied to several operations like searching, sending contact forms, or translating. If affected by it, you are blocked for a certain period, until you can perform the operation again.
sv: FÃ¶r att undvika missbruk av grÃ¤nssnittet tillÃ¤mpas hastighetsbegrÃ¤nsning pÃ¥ flera Ã¥tgÃ¤rder, sÃ¥som sÃ¶kning, skickande av kontaktformulÃ¤r eller Ã¶versÃ¤ttning. Om du pÃ¥verkas av detta blockeras du under en viss period, tills du kan utfÃ¶ra Ã¥tgÃ¤rden igen.

source: Default limits and fine-tuning is described in the administrative manual, see :ref:`rate-limit`.
sv: StandardgrÃ¤nser och finjustering beskrivs i administrationshandboken, se :ref:`rate-limit`.

source: Change terminology effectively or perform bulk fixing of the strings using :guilabel:`Search and replace` in the :guilabel:`Tools` menu.
sv: Ãndra terminologin effektivt eller utfÃ¶r masskorrigeringar av strÃ¤ngarna med hjÃ¤lp av :guilabel:`SÃ¶k och ersÃ¤tt` i menyn :guilabel:`Verktyg`.

source: Don't worry about messing up the strings, as it is a two-step process. A preview of edited strings is shown before confirming the change.
sv: Oroa dig inte fÃ¶r att fÃ¶rstÃ¶ra strÃ¤ngarna, eftersom det Ã¤r en tvÃ¥stegsprocess. En fÃ¶rhandsgranskning av redigerade strÃ¤ngar visas innan Ã¤ndringen bekrÃ¤ftas.

source: Bulk editing allows performing one operation for multiple strings. Define strings by searching for them and actions to perform on matching ones. Supported operations:
sv: Massredigering gÃ¶r det mÃ¶jligt att utfÃ¶ra en Ã¥tgÃ¤rd fÃ¶r flera strÃ¤ngar. Definiera strÃ¤ngar genom att sÃ¶ka efter dem och Ã¥tgÃ¤rder som ska utfÃ¶ras pÃ¥ matchande strÃ¤ngar. StÃ¶dda Ã¥tgÃ¤rder:

source: Change string state (for example to approve all unreviewed strings).
sv: Ãndra strÃ¤ngstatus (till exempel fÃ¶r att godkÃ¤nna alla granskade strÃ¤ngar).

source: Adjust translation flags (see :ref:`custom-checks`)
sv: Justera Ã¶versÃ¤ttningsflaggor (se :ref:`custom-checks`)

source: Adjust string labels (see :ref:`labels`)
sv: Justera strÃ¤ngetiketter (se :ref:`labels`)

source: This tool is called :guilabel:`Bulk edit`, accessible in the :guilabel:`Tools` menu of each project, component or translation.
sv: Det hÃ¤r verktyget heter :guilabel:`Massredigering` och finns i menyn :guilabel:`Verktyg` fÃ¶r varje projekt, komponent eller Ã¶versÃ¤ttning.

source: :ref:`Bulk edit add-on <addon-weblate.flags.bulk>`
sv: :ref:`TillÃ¤gg fÃ¶r massredigering <addon-weblate.flags.bulk>`

source: Matrix View
sv: Matrisvy

source: You can compare different languages efficiently using this view. It is available on every component page, from the :guilabel:`Tools` menu. First select all languages you want to compare, confirm your selection, then click on any translation to open and edit it.
sv: Du kan jÃ¤mfÃ¶ra olika sprÃ¥k effektivt med hjÃ¤lp av denna vy. Den Ã¤r tillgÃ¤nglig pÃ¥ varje komponentsida, frÃ¥n menyn :guilabel:`Verktyg`. VÃ¤lj fÃ¶rst alla sprÃ¥k du vill jÃ¤mfÃ¶ra, bekrÃ¤fta ditt val och klicka sedan pÃ¥ valfri Ã¶versÃ¤ttning fÃ¶r att Ã¶ppna och redigera den.

source: The matrix view is also a very good starting point to find missing translations in different languages, and quickly add them from one view.
sv: Matrisvyn Ã¤r ocksÃ¥ en mycket bra utgÃ¥ngspunkt fÃ¶r att hitta saknade Ã¶versÃ¤ttningar pÃ¥ olika sprÃ¥k och snabbt lÃ¤gga till dem frÃ¥n en vy.

source: Zen Mode
sv: Zen-lÃ¤ge

source: This mode simplifies the layout and removes additional UI elements such as :guilabel:`Nearby strings` or the :guilabel:`Glossary`. It is available by clicking the :guilabel:`Zen` button on the top-right of the regular editor (translation of a string).
sv: Det hÃ¤r lÃ¤get fÃ¶renklar layouten och tar bort extra UI-element som :guilabel:`NÃ¤rliggande strÃ¤ngar` eller :guilabel:`Ordlista`. Du kommer Ã¥t det genom att klicka pÃ¥ :guilabel:`Zen`-knappen lÃ¤ngst upp till hÃ¶ger i den vanliga redigeraren (Ã¶versÃ¤ttning av en strÃ¤ng).

source: You can select the Zen editor as your default editor using the :ref:`profile-preferences` tab on your :ref:`user-profile`. You can also choose there between having translations listed :guilabel:`Top to bottom` or :guilabel:`Side by side`, depending on your personal preference.
sv: Du kan vÃ¤lja Zen-redigeraren som standardredigerare under fliken :ref:`profile-preferences` i din :ref:`user-profile`. DÃ¤r kan du ocksÃ¥ vÃ¤lja mellan att visa Ã¶versÃ¤ttningar :guilabel:`UppifrÃ¥n och ner` eller :guilabel:`Sida vid sida`, beroende pÃ¥ vad du fÃ¶redrar.

source: Weblate currently supports :ref:`vcs-git` (with extended support for :ref:`vcs-github`, :ref:`vcs-gitlab`, :ref:`vcs-gitea`, :ref:`vcs-gerrit`, :ref:`vcs-git-svn`, :ref:`vcs-bitbucket-cloud`, :ref:`vcs-bitbucket-data-center`, and :ref:`vcs-azure-devops`) and :ref:`vcs-mercurial` as version control back-ends.
sv: Weblate stÃ¶der fÃ¶r nÃ¤rvarande :ref:`vcs-git` (med utÃ¶kat stÃ¶d fÃ¶r :ref:`vcs-github`, :ref:`vcs-gitlab`, :ref:`vcs-gitea`, :ref:`vcs-gerrit`, :ref:`vcs-git-svn`, :ref:`vcs-bitbucket-cloud`, :ref:`vcs-bitbucket-data-center` och :ref:`vcs-azure-devops`) och :ref:`vcs-mercurial` som versionshanteringsbackend.

source: Accessing repositories
sv: Ã tkomst till arkiv

source: The VCS repository you want to use has to be accessible to Weblate. With a publicly available repository you just need to enter the correct URL (for example ``https://github.com/WeblateOrg/weblate.git``), but for private repositories or for push URLs the setup is more complex and requires authentication.
sv: Det VCS-arkiv du vill anvÃ¤nda mÃ¥ste vara tillgÃ¤ngligt fÃ¶r Weblate. FÃ¶r ett offentligt tillgÃ¤ngligt arkiv behÃ¶ver du bara ange rÃ¤tt URL (till exempel ``https://github.com/WeblateOrg/weblate.git``), men fÃ¶r privata arkiv eller push-URL:er Ã¤r instÃ¤llningarna mer komplexa och krÃ¤ver autentisering.

source: Accessing repositories from Hosted Weblate
sv: Ã tkomst till arkiv frÃ¥n Hosted Weblate

source: This section applies **only** to Hosted Weblate (hosted.weblate.org). If you are running your own self-hosted Weblate instance, please see :ref:`the next section <vcs-repos-code-hosting>` instead.
sv: Detta avsnitt gÃ¤ller **endast** Hosted Weblate (hosted.weblate.org). Om du kÃ¶r din egen sjÃ¤lvhostade Weblate-instans, se istÃ¤llet :ref:`nÃ¤sta avsnitt <vcs-repos-code-hosting>`.

source: For Hosted Weblate, there is a dedicated push user registered on GitHub, Bitbucket, Codeberg, and GitLab (with the username :guilabel:`weblate`, e-mail ``hosted@weblate.org``, and a name or profile description :guilabel:`Weblate push user`).
sv: FÃ¶r Hosted Weblate finns en dedikerad push-anvÃ¤ndare registrerad pÃ¥ GitHub, Bitbucket, Codeberg och GitLab (med anvÃ¤ndarnamnet :guilabel:`weblate`, e-postadressen ``hosted@weblate.org`` och namnet eller profilbeskrivningen :guilabel:`Weblate push user`).

source: There can be more Weblate users on the platforms, designated for other Weblate instances. Searching by e-mail ``hosted@weblate.org`` is recommended to find the correct user for Hosted Weblate.
sv: Det kan finnas fler Weblate-anvÃ¤ndare pÃ¥ plattformarna, avsedda fÃ¶r andra Weblate-instanser. Vi rekommenderar att du sÃ¶ker efter e-postadressen ``hosted@weblate.org`` fÃ¶r att hitta rÃ¤tt anvÃ¤ndare fÃ¶r Hosted Weblate.

source: You need to add this user as a collaborator and give it appropriate permissions to your repository (read-only is okay for cloning, write is required for pushing). Depending on the service and your organizationâs settings, this happens immediately, or requires confirmation on the Weblate side.
sv: Du mÃ¥ste lÃ¤gga till denna anvÃ¤ndare som medarbetare och ge den lÃ¤mpliga behÃ¶righeter till ditt arkiv (skrivskyddat Ã¤r tillrÃ¤ckligt fÃ¶r kloning, skrivbehÃ¶righet krÃ¤vs fÃ¶r pushning). Beroende pÃ¥ tjÃ¤nsten och din organisations instÃ¤llningar sker detta omedelbart eller krÃ¤ver bekrÃ¤ftelse frÃ¥n Weblate.

source: The :guilabel:`weblate` user on GitHub accepts invitations automatically within five minutes. Manual processing might be needed on the other services, so please be patient.
sv: AnvÃ¤ndaren :guilabel:`weblate` pÃ¥ GitHub accepterar inbjudningar automatiskt inom fem minuter. Manuell bearbetning kan behÃ¶vas pÃ¥ de andra tjÃ¤nsterna, sÃ¥ var tÃ¥lmodig.

source: Once the :guilabel:`weblate` user is added to your repository, you can configure :ref:`component-repo` and :ref:`component-push` using the SSH protocol (for example ``git@github.com:WeblateOrg/weblate.git``).
sv: NÃ¤r anvÃ¤ndaren :guilabel:`weblate` har lagts till i ditt arkiv kan du konfigurera :ref:`component-repo` och :ref:`component-push` med hjÃ¤lp av SSH-protokollet (till exempel ``git@github.com:WeblateOrg/weblate.git``).

source: Accessing repositories on code hosting sites (GitHub, GitLab, Bitbucket, Azure DevOps, ...)
sv: Ã tkomst till arkiv pÃ¥ kodhostingsajter (GitHub, GitLab, Bitbucket, Azure DevOps, ...)

source: This section applies to **self-hosted** Weblate instances. If you are using Hosted Weblate (hosted.weblate.org), see :ref:`hosted-push` instead.
sv: Detta avsnitt gÃ¤ller **sjÃ¤lvhostade** Weblate-instanser. Om du anvÃ¤nder Hosted Weblate (hosted.weblate.org) ska du istÃ¤llet se :ref:`hosted-push`.

source: For self-hosted Weblate, accessing repositories on code hosting sites is typically done by creating a dedicated user who is associated with a Weblate SSH key (see :ref:`weblate-ssh-key`). This way you associate Weblate SSH key with a single user (platforms frequently enforce single use of a SSH key) and grant this user access to the repository. You can then use SSH URL to access the repository (see :ref:`ssh-repos`).
sv: FÃ¶r sjÃ¤lvhostad Weblate sker Ã¥tkomst till arkiv pÃ¥ kodhostingsajter vanligtvis genom att skapa en dedikerad anvÃ¤ndare som Ã¤r associerad med en Weblate SSH-nyckel (se :ref:`weblate-ssh-key`). PÃ¥ sÃ¥ sÃ¤tt associerar du Weblate SSH-nyckeln med en enda anvÃ¤ndare (plattformar krÃ¤ver ofta att en SSH-nyckel endast anvÃ¤nds av en anvÃ¤ndare) och ger denna anvÃ¤ndare Ã¥tkomst till arkivet. Du kan sedan anvÃ¤nda SSH-URL fÃ¶r att fÃ¥ Ã¥tkomst till arkivet (se :ref:`ssh-repos`).

source: SSH repositories
sv: SSH-arkiv

source: The most frequently used method to access private repositories is based on SSH. Authorize the public Weblate SSH key (see :ref:`weblate-ssh-key`) to access the upstream repository this way.
sv: Den vanligaste metoden fÃ¶r att komma Ã¥t privata arkiv baseras pÃ¥ SSH. Auktorisera den offentliga Weblate SSH-nyckeln (se :ref:`weblate-ssh-key`) fÃ¶r att komma Ã¥t uppstrÃ¶msarkivet pÃ¥ detta sÃ¤tt.

source: On GitHub, each key can only be used once, see :ref:`vcs-repos-github` and :ref:`hosted-push`.
sv: PÃ¥ GitHub kan varje nyckel endast anvÃ¤ndas en gÃ¥ng, se :ref:`vcs-repos-github` och :ref:`hosted-push`.

source: Weblate also stores the host key fingerprint upon first connection, and fails to connect to the host should it be changed later (see :ref:`verify-ssh`).
sv: Weblate lagrar ocksÃ¥ vÃ¤rdens nyckelfingeravtryck vid fÃ¶rsta anslutningen och misslyckas med att ansluta till vÃ¤rden om det Ã¤ndras senare (se :ref:`verify-ssh`).

source: In case adjustment is needed, do so from the Weblate admin interface:
sv: Om justeringar behÃ¶vs, gÃ¶r det frÃ¥n Weblate-administratÃ¶rsgrÃ¤nssnittet:

source: Weblate SSH key
sv: Weblate SSH-nyckel

source: Weblate now generates both RSA and Ed25519 SSH keys. Using Ed25519 is recommended for new setups.
sv: Weblate genererar nu bÃ¥de RSA- och Ed25519 SSH-nycklar. Vi rekommenderar att du anvÃ¤nder Ed25519 fÃ¶r nya installationer.

source: The Weblate public key is visible to all users browsing the :guilabel:`About` page.
sv: Weblates publika nyckel Ã¤r synlig fÃ¶r alla anvÃ¤ndare som besÃ¶ker sidan :guilabel:`Om`.

source: Admins can generate or display the public key currently used by Weblate in the connection (from :guilabel:`SSH keys`) on the admin interface landing page.
sv: AdministratÃ¶rer kan generera eller visa den publika nyckel som fÃ¶r nÃ¤rvarande anvÃ¤nds av Weblate i anslutningen (frÃ¥n :guilabel:`SSH-nycklar`) pÃ¥ administratÃ¶rsgrÃ¤nssnittets startsida.

source: The corresponding private SSH key can not currently have a password, so ensure it is well protected.
sv: Den motsvarande privata SSH-nyckeln kan fÃ¶r nÃ¤rvarande inte ha ett lÃ¶senord, sÃ¥ se till att den Ã¤r vÃ¤l skyddad.

source: Make a backup of the generated private Weblate SSH key.
sv: GÃ¶r en sÃ¤kerhetskopia av den genererade privata Weblate SSH-nyckeln.

source: Verifying SSH host keys
sv: Verifiera SSH-vÃ¤rdnycklar

source: Weblate automatically stores the SSH host keys on first access and remembers them for further use.
sv: Weblate lagrar automatiskt SSH-vÃ¤rdnycklarna vid fÃ¶rsta Ã¥tkomsten och kommer ihÃ¥g dem fÃ¶r vidare anvÃ¤ndning.

source: In case you want to verify the key fingerprint before connecting to the repository, add the SSH host keys of the servers you are going to access in :guilabel:`Add host key`, from the same section of the admin interface. Enter the hostname you are going to access (e.g. ``gitlab.com``), and press :guilabel:`Submit`. Verify its fingerprint matches the server you added.
sv: Om du vill verifiera nyckelfingeravtrycket innan du ansluter till arkivet, lÃ¤gg till SSH-vÃ¤rdnycklarna fÃ¶r de servrar du ska komma Ã¥t i :guilabel:`LÃ¤gg till vÃ¤rdnyckel`, frÃ¥n samma avsnitt i administratÃ¶rsgrÃ¤nssnittet. Ange vÃ¤rdnamnet du ska komma Ã¥t (t.ex. ``gitlab.com``) och tryck pÃ¥ :guilabel:`Skicka`. Kontrollera att fingeravtrycket stÃ¤mmer Ã¶verens med den server du lagt till.

source: The added keys with fingerprints are shown in the confirmation message:
sv: De tillagda nycklarna med fingeravtryck visas i bekrÃ¤ftelsemeddelandet:

source: Connecting to legacy SSH servers
sv: Ansluta till Ã¤ldre SSH-servrar

source: Recent OpenSSH releases (for example the one used in Weblate Docker container) disable RSA signatures using the SHA-1 hash algorithm by default. This change has been made as the SHA-1 hash algorithm is cryptographically broken, and it is possible to create chosen-prefix hash collisions for <USD$50K.
sv: Senaste versioner av OpenSSH (till exempel den som anvÃ¤nds i Weblate Docker-containern) inaktiverar RSA-signaturer som anvÃ¤nder SHA-1-hashalgoritmen som standard. Denna Ã¤ndring har gjorts eftersom SHA-1-hashalgoritmen Ã¤r kryptografiskt knÃ¤ckt och det Ã¤r mÃ¶jligt att skapa hash-kollisioner med valt prefix fÃ¶r mindre Ã¤n 50 000 USD.

source: For most users, this change should be invisible and there is no need to replace ssh-rsa keys. OpenSSH has supported RFC8332 RSA/SHA-256/512 signatures since release 7.2 and existing ssh-rsa keys will automatically use the stronger algorithm where possible.
sv: FÃ¶r de flesta anvÃ¤ndare bÃ¶r denna Ã¤ndring vara osynlig och det finns inget behov av att byta ut ssh-rsa-nycklar. OpenSSH har stÃ¶tt RFC8332 RSA/SHA-256/512-signaturer sedan version 7.2 och befintliga ssh-rsa-nycklar kommer automatiskt att anvÃ¤nda den starkare algoritmen dÃ¤r det Ã¤r mÃ¶jligt.

source: Incompatibility is more likely when connecting to older SSH implementations that have not been upgraded or have not closely tracked improvements in the SSH protocol. The SSH connection to such server will fail with:
sv: Inkompatibilitet Ã¤r mer sannolikt nÃ¤r du ansluter till Ã¤ldre SSH-implementeringar som inte har uppgraderats eller som inte noggrant har fÃ¶ljt fÃ¶rbÃ¤ttringarna i SSH-protokollet. SSH-anslutningen till en sÃ¥dan server kommer att misslyckas med:

source: For these cases, it may be necessary to selectively re-enable RSA/SHA1 to allow connection and/or user authentication via the HostkeyAlgorithms and PubkeyAcceptedAlgorithms options. For example, the following stanza in :file:`DATA_DIR/ssh/config` will enable RSA/SHA1 for host and user authentication for a single destination host:
sv: I dessa fall kan det vara nÃ¶dvÃ¤ndigt att selektivt Ã¥teraktivera RSA/SHA1 fÃ¶r att tillÃ¥ta anslutning och/eller anvÃ¤ndarautentisering via alternativen HostkeyAlgorithms och PubkeyAcceptedAlgorithms. Till exempel kommer fÃ¶ljande strof i :file:`DATA_DIR/ssh/config` att aktivera RSA/SHA1 fÃ¶r vÃ¤rd- och anvÃ¤ndarautentisering fÃ¶r en enskild destinationsvÃ¤rd:
